РП/src/Enums/ТочностьГрафикаПроизводства/ТочностьГрафикаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТочностьГрафикаПроизводства</name>
  <enumValues>
    <name>Час</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/УправлениеМаршрутнымиЛистами/УправлениеМаршрутнымиЛистами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УправлениеМаршрутнымиЛистами</name>
  <enumValues>
    <name>МетодикаББВ</name>
  </enumValues>
  <enumValues>
    <name>ПооперационноеПланирование</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияОпераций</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбособленногоУчетаТоваров</name>
    <type>
      <types>EnumRef.ВариантыОбособленногоУчетаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПланирования</name>
    <type>
      <types>EnumRef.ТочностьГрафикаПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеМаршрутнымиЛистами</name>
    <type>
      <types>EnumRef.УправлениеМаршрутнымиЛистами</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПооперационногоУправления</name>
    <type>
      <types>EnumRef.СпособыУправленияОперациями</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеДиспетчер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполненияЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСебестоимостьПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоБезЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСписаниеЗатратНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияПолуфабрикатов</name>
    <type>
      <types>EnumRef.СпособыПолученияПолуфабрикатовПроизводимыхВПроцессе</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/CommonModules/ПроизводствоСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы "Производство"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает параметры производственного подразделения
//
// Параметры:
//  Подразделение	- СправочникСсылка.СтруктураПредприятия - Подразделение для которого требуется получить параметры
//
// Возвращаемое значение:
//   Структура   - содержит параметры производственного подразделения
//
Функция ПараметрыПроизводственногоПодразделения(Подразделение) Экспорт

	ОсновнойКалендарьПредприятия = Константы.ОсновнойКалендарьПредприятия.Получить();
	
	Параметры = Новый Структура;
	Параметры.Вставить("Наименование",                   "");
	Параметры.Вставить("ГрафикРаботы",                   ОсновнойКалендарьПредприятия);
	Параметры.Вставить("НачалоИнтервалаПланирования",    '00010101');
	Параметры.Вставить("ОкончаниеИнтервалаПланирования", КонецДня('00010101'));
	Параметры.Вставить("ПодразделениеДиспетчер",         Ложь);
	Параметры.Вставить("ПроизводствоПоЗаказам",          Ложь);
	Параметры.Вставить("ПроизводствоБезЗаказов",         Ложь);
	Параметры.Вставить("ИспользуетсяСписаниеЗатратНаВыпуск", Ложь);
	//++ НЕ УТКА
	Параметры.Вставить("ИнтервалПланирования", Перечисления.ТочностьГрафикаПроизводства.День);
	Параметры.Вставить("УправлениеМаршрутнымиЛистами", Перечисления.УправлениеМаршрутнымиЛистами.МетодикаББВ);
	Параметры.Вставить("СпособПооперационногоУправления", Перечисления.СпособыУправленияОперациями.ПустаяСсылка());
	//-- НЕ УТКА
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка КАК Подразделение,
		|	СтруктураПредприятия.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА СтруктураПредприятия.ГрафикРаботы <> ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
		|			ТОГДА СтруктураПредприятия.ГрафикРаботы
		|		ИНАЧЕ &ОсновнойКалендарьПредприятия
		|	КОНЕЦ КАК ГрафикРаботы,
		|	СтруктураПредприятия.ИнтервалПланирования,
		|	СтруктураПредприятия.НачалоИнтервалаПланирования КАК НачалоИнтервалаПланирования,
		|	СтруктураПредприятия.ОкончаниеИнтервалаПланирования КАК ОкончаниеИнтервалаПланирования,
		|	СтруктураПредприятия.УправлениеМаршрутнымиЛистами,
		|	СтруктураПредприятия.СпособПооперационногоУправления,
		|	СтруктураПредприятия.ПодразделениеДиспетчер,
		|	СтруктураПредприятия.ПроизводствоПоЗаказам,
		|	СтруктураПредприятия.ПроизводствоБезЗаказов,
		|	СтруктураПредприятия.ИспользуетсяСписаниеЗатратНаВыпуск
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Ссылка = &Подразделение";
		
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("ОсновнойКалендарьПредприятия", ОсновнойКалендарьПредприятия);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(Параметры, Выборка);
			
		КонецЕсли;
		
	КонецЕсли; 

	Возврат Параметры;
	
КонецФункции

// Возвращает параметры производственного подразделения
//
// Параметры:
//  СписокПодразделений	- Массив - список подразделений для которых требуется получить параметры
//
// Возвращаемое значение:
//  Соответствие, где ключ - ссылка на подразделение, а Значение - структура, которая 
//				содержит параметры производственного подразделения
//
Функция ПараметрыПроизводственныхПодразделений(СписокПодразделений) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка КАК Подразделение,
	|	СтруктураПредприятия.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА СтруктураПредприятия.ГрафикРаботы <> ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
	|			ТОГДА СтруктураПредприятия.ГрафикРаботы
	|		ИНАЧЕ ОсновнойКалендарьПредприятия.Значение
	|	КОНЕЦ КАК ГрафикРаботы,
	|	СтруктураПредприятия.ИнтервалПланирования КАК ИнтервалПланирования,
	|	СтруктураПредприятия.НачалоИнтервалаПланирования КАК НачалоИнтервалаПланирования,
	|	СтруктураПредприятия.ОкончаниеИнтервалаПланирования КАК ОкончаниеИнтервалаПланирования,
	|	СтруктураПредприятия.УправлениеМаршрутнымиЛистами КАК УправлениеМаршрутнымиЛистами,
	|	СтруктураПредприятия.СпособПооперационногоУправления КАК СпособПооперационногоУправления
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия,
	|	Константа.ОсновнойКалендарьПредприятия КАК ОсновнойКалендарьПредприятия
	|ГДЕ
	|	СтруктураПредприятия.Ссылка В(&СписокПодразделений)";
	
	Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ЗначенияПараметров = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Параметры = Новый Структура("Наименование,
									|ГрафикРаботы,
									|ИнтервалПланирования,
									|НачалоИнтервалаПланирования,
									|ОкончаниеИнтервалаПланирования,
									|УправлениеМаршрутнымиЛистами,
									|СпособПооперационногоУправления");
								
		ЗаполнитьЗначенияСвойств(Параметры, Выборка);
		ЗначенияПараметров.Вставить(Выборка.Подразделение, Параметры);
	КонецЦикла;

	Возврат ЗначенияПараметров;
	
КонецФункции

#КонецОбласти
